#+BEGIN_COMMENT
.. title: Sets
.. slug: sets
.. date: 2019-12-14 18:10:15 UTC-08:00
.. tags: sets,scala
.. category: Scala
.. link: 
.. description: Sets in Scala.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
In this assignment, you will work with a functional representation of sets based on the mathematical notion of [[https://www.wikiwand.com/en/Characteristic_function][characteristic functions]]. The goal is to gain practice with higher-order functions.

* Representation

We will work with sets of integers.

As an example to motivate our representation, how would you represent the set of all negative integers? You cannot list them all… one way would be to say: if you give me an integer, I can tell you whether it’s in the set or not: for 3, I say ‘no’; for -1, I say yes.

Mathematically, we call the function which takes an integer as argument and which returns a boolean indicating whether the given integer belongs to a set, the /characteristic function/ of the set. For example, we can characterize the set of negative integers by the characteristic function =(x: Int) => x < 0=.

Therefore, we choose to represent a set by its characteristic function and define a type alias for this representation:

#+begin_src jupyter-scala
type FunSet = Int => Boolean
#+end_src

#+RESULTS:
: # Out[1]:
: : defined [32mtype[39m [36mFunSet[39m

Using this representation, we define a function that tests for the presence of a value in a set:

#+begin_src jupyter-scala
def contains(s: FunSet, elem: Int): Boolean = s(elem)
#+end_src

#+RESULTS:
: # Out[2]:
: : defined [32mfunction[39m [36mcontains[39m

** Basic Functions on Sets

Let’s start by implementing basic functions on sets. Define a function which creates a singleton set from one integer value: the set represents the set of the one given element. Its signature is as follows:

#+begin_src jupyter-scala
def singletonSet(elem: Int): FunSet = {
  Set(elem)
}
#+end_src

#+RESULTS:
: # Out[3]:
: : defined [32mfunction[39m [36msingletonSet[39m

Now that we have a way to create singleton sets, we want to define a function that allow us to build bigger sets from smaller ones.

